# GetHiddenOpenings Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..GetHiddenOpenings Method
AnalyticalModelSurface Class See Also
---
Retrieves Identifiers of all hidden openings.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void GetHiddenOpenings(
	out ICollection<ElementId> openingsIds
)
```

Visual Basic
---
```text
Public Sub GetHiddenOpenings ( _
	<OutAttribute> ByRef openingsIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void GetHiddenOpenings(
	[OutAttribute] ICollection<ElementId^>^% openingsIds
)
```

# ### Parameters
openingsIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)>% Set of openings Identifiers which are hidden in Analytical Surface Element.
# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace